src/Catalogs/кфкКаналыСпецификации/кфкКаналыСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкКаналыСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.кфкПриложенияСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>CatalogRef.кфкТипыДанныхСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресТопика</name>
    <comment>channels.{ИмяКанала}.address: {АдресТопика}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКанала</name>
    <comment>channels.{ИмяКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперации</name>
    <comment>operations.{ИмяОперации}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщения</name>
    <comment>components.messages.{ИмяСообщения}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщенияКанала</name>
    <comment>channels.{ИмяКанала}.messages.{ИмяСообщенияКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.кфкПриложенияСпецификаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкКаналыСпецификации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = "АдресТопика,ИмяКанала,ИмяОперации,ИмяСообщения,ИмяСообщенияКанала";
	Для Каждого ИмяРеквизита Из СтрРазделить(Реквизиты, ",") Цикл
		ЭтотОбъект[ИмяРеквизита] = СокрЛП(ЭтотОбъект[ИмяРеквизита]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.кфкТипыДанныхСпецификации") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТипДанных = ДанныеЗаполнения;
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Код,Владелец");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
